In [26]:
import pandas as pd

# Part A — Load & Inspect

1. Load the Titanic CSV file into a DataFrame named df.

2. Show the first 5 rows and the data types of all columns.

3. Print the total number of rows and columns.

In [27]:
df = pd.read_csv("Titanic Dataset.csv")

print(df.head())

   pclass  survived                                             name     sex  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

     age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.00      0      0   24160  211.3375       B5        S    2    NaN
1   0.92      1      2  113781  151.5500  C22 C26        S   11    NaN
2   2.00      1      2  113781  151.5500  C22 C26        S  NaN    NaN
3  30.00      1      2  113781  151.5500  C22 C26        S  NaN  135.0
4  25.00      1      2  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [28]:
df.shape

(1309, 14)

# Part B — Sorting

4. Sort the passengers by Fare in descending order and show the top 10.

5. Sort by Age (youngest first), then by Fare (highest first).

6. Find the top 5 oldest passengers.

In [32]:
# Top 10 highest fares
df.sort_values(by="fare", ascending=False).head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
183,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,3,NaN,NaN
302,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,3,NaN,NaN
49,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Austria-Hungary / Germantown, Philadelphia, PA"
50,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Germantown, Philadelphia, PA"
113,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,10,NaN,"Winnipeg, MB"
114,1,0,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,NaN,NaN,"Winnipeg, MB"
115,1,0,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,NaN,"Winnipeg, MB"
116,1,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S,10,NaN,"Winnipeg, MB"
111,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S,10,NaN,"Winnipeg, MB"
112,1,1,"Fortune, Miss. Ethel Flora",female,28.0,3,2,19950,263.0000,C23 C25 C27,S,10,NaN,"Winnipeg, MB"

In [31]:
# Top 5 oldest passengers
df.sort_values(by="age", ascending=False).head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,NaN,NaN,NaN
135,1,0,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,NaN,NaN,"New York, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [35]:
oldest_passengers = df.loc[df["survived"].idxmax()]
print(oldest_passengers.head())

pclass                                  1
survived                                1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                  29.0
Name: 0, dtype: object

# Part C — Filtering

7. Filter passengers who survived (Survived == 1).

8. Show passengers who are female and in first class.

9. Filter passengers with Age < 18 or Fare > 100.

In [37]:
df[df["survived"] == 1]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.00,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.00,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.00,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1277,3,1,"Vartanian, Mr. David",male,22.00,0,0,2658,7.2250,NaN,C,13 15,NaN,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.00,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.00,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN

In [40]:
df[['sex', 'pclass']]

         sex  pclass
0     female       1
1       male       1
2     female       1
3       male       1
4     female       1
...      ...     ...
1304  female       3
1305  female       3
1306    male       3
1307    male       3
1308    male       3

[1309 rows x 2 columns]

In [41]:
df[df["age"] < 18]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
53,1,0,"Carrau, Mr. Jose Pedro",male,17.00,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
54,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
55,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1265,3,0,"Van Impe, Miss. Catharina",female,10.00,0,2,345773,24.1500,NaN,S,NaN,NaN,NaN
1275,3,0,"Vander Planke, Mr. Leo Edmondus",male,16.00,2,0,345764,18.0000,NaN,S,NaN,NaN,NaN
1279,3,0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.00,0,0,350406,7.8542,NaN,S,NaN,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN

# Part D — GroupBy & Aggregation

10. Group by Pclass and compute average Age and Fare.

11. Group by Sex and calculate passenger count and survival rate.

12. Group by Pclass and Sex and compute average Fare.

13. For each Embarked port, find the count of survivors

In [53]:
df.groupby(['pclass', 'fare'])['age'].mean()

pclass  fare
1       0.0000     41.500000
        5.0000     33.000000
        25.5875    47.000000
        25.7000    55.000000
        25.7417          NaN
                     ...
3       34.3750    22.400000
        39.6875    14.714286
        46.9000    18.000000
        56.4958    29.500000
        69.5500    14.500000
Name: age, Length: 288, dtype: float64

In [54]:
df.groupby(['name', 'sex'])['survived'].count()

name                                           sex
Abbing, Mr. Anthony                            male      1
Abbott, Master. Eugene Joseph                  male      1
Abbott, Mr. Rossmore Edward                    male      1
Abbott, Mrs. Stanton (Rosa Hunt)               female    1
Abelseth, Miss. Karen Marie                    female    1
                                                        ..
del Carlo, Mrs. Sebastiano (Argenia Genovesi)  female    1
van Billiard, Master. James William            male      1
van Billiard, Master. Walter John              male      1
van Billiard, Mr. Austin Blyler                male      1
van Melkebeke, Mr. Philemon                    male      1
Name: survived, Length: 1307, dtype: int64

In [56]:
df.groupby(['pclass', 'sex'])['fare'].mean()

pclass  sex
1       female    109.412385
        male       69.888385
2       female     23.234827
        male       19.904946
3       female     15.324250
        male       12.415462
Name: fare, dtype: float64

In [57]:
df.groupby('embarked')['survived'].count()

embarked
C    270
Q    123
S    914
Name: survived, dtype: int64

# Part E — Combined Operations

14. Among survivors, compute average Fare by Pclass and sort descending.

15. For each Pclass, find the passenger with the highest Fare.

In [60]:
df[df['survived'] == 1].groupby('pclass')['fare'].mean().sort_values(ascending=False)

pclass
1    98.023314
2    23.008124
3    12.916919
Name: fare, dtype: float64